app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$GUtM0cg4yag63j8Hc76/be.E1MQyWTTsApGzCEtU.UdEtO4p45xVa"], ["updated_at", 2017-04-01 15:06:51 UTC], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)